# St7SetSRAType

Assigns the spectrum type used for Spectral Response analysis.

long St7SetSRAType(long uID, long SpectrumType)
Input Parameters
uID
Strand7 model file ID.
SpectrumType
Type of spectrum supplied; either stResponse or stPSD.